"""Задача 2: Найдите сумму цифр трехзначного числа."""
number = int(input('Введите трехзначное число:'))
a = number // 100
b = number // 10 % 10
c = number % 10
print((a + b + c))

"""Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов. 
Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали 
одинаковое количество журавликов, а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?"""
s = int(input('Введите сколько журавликов сделали дети:'))
print((s//6), ((s//6)*4), (s//6))

"""Задача 6: Вы пользуетесь общественным транспортом? Вероятно, вы расплачивались за проезд 
и получали билет с номером. Счастливым билетом называют такой билет с шестизначным номером, 
где сумма первых трех цифр равна сумме последних трех. Т.е. билет с номером 385916 – счастливый,
т.к. 3+8+5=9+1+6. Вам требуется написать программу, которая проверяет счастливость билета."""
number = input('Введите номер билета:')
s1 = int(number[0]) + int(number[1]) + int(number[2])
s2 = int(number[3]) + int(number[4]) + int(number[5])
if s1 != s2:
    print('no')
else:
    print('yes')

"""Задача 8: Требуется определить, можно ли от шоколадки размером n × m долек отломить k долек, 
если разрешается сделать один разлом по прямой между дольками (то есть разломить шоколадку на два прямоугольника)"""
n = int(input('Введите сколько долек длинна шоколадки:'))
m = int(input('Введите сколько долек ширина шоколадки:'))
k = int(input('На сколько частей хотим поделить:'))
if k < m*n and (k%m==0 or k%n==0):
    print('Так можно поделить на 2 прямоугольника')
else:
    print('Так нельзя поделить на 2 прямоугольника')