"""Задача 2: Найдите сумму цифр трехзначного числа."""
"""number = int(input('Введите трехзначное число:'))
a = number // 100
b = number // 10 % 10
c = number % 10
print((a + b + c))"""

"""Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов. 
Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали 
одинаковое количество журавликов, а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?"""
"""s = int(input('Введите сколько журавликов сделали дети:'))
print((s//6), ((s//6)*4), (s//6))"""

"""Задача 6: Вы пользуетесь общественным транспортом? Вероятно, вы расплачивались за проезд 
и получали билет с номером. Счастливым билетом называют такой билет с шестизначным номером, 
где сумма первых трех цифр равна сумме последних трех. Т.е. билет с номером 385916 – счастливый,
т.к. 3+8+5=9+1+6. Вам требуется написать программу, которая проверяет счастливость билета."""
"""number = input('Введите номер билета:')
s1 = int(number[0]) + int(number[1]) + int(number[2])
s2 = int(number[3]) + int(number[4]) + int(number[5])
if s1 != s2:
    print('no')
else:
    print('yes')"""

"""Задача 8: Требуется определить, можно ли от шоколадки размером n × m долек отломить k долек, 
если разрешается сделать один разлом по прямой между дольками (то есть разломить шоколадку на два прямоугольника)"""
"""n = int(input('Введите сколько долек длинна шоколадки:'))
m = int(input('Введите сколько долек ширина шоколадки:'))
k = int(input('На сколько частей хотим поделить:'))
if k < m*n and (k%m==0 or k%n==0):
    print('Так можно поделить на 2 прямоугольника')
else:
    print('Так нельзя поделить на 2 прямоугольника')"""

"""Задача 10: На столе лежат n монеток. Некоторые из них лежат вверх решкой, а некоторые – гербом. 
Определите минимальное число монеток, которые нужно перевернуть, чтобы все монетки были повернуты 
вверх одной и той же стороной. Выведите минимальное количество монет, которые нужно перевернуть"""

"""n = int(input('Введите кол-во монеток: '))
print('Разложте монетки на столе:')
print('1 это орел, 0 это решка')
tails = 0
for i in range(n):
    eagle = int(input())
    if eagle == 1:
       tails += 1
print('Нужно перевернуть: ', tails if tails < n / 2 else n - tails)"""

"""Задача 12: Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница. 
Петя помогает Кате по математике. Он задумывает два натуральных числа X и Y (X,Y≤1000), 
а Катя должна их отгадать. Для этого Петя делает две подсказки. Он называет сумму этих чисел S и их произведение P. 
Помогите Кате отгадать задуманные Петей числа."""

"""sum_numbers = int(input('Введите сумму 2-х загаданных чисел: '))
product_numbers = int(input('Введите произведение 2-х загаданных чисел: '))
for i in range(0,sum_numbers):
    for j in range(0,product_numbers):
        if i * j == product_numbers:
            if i + j == sum_numbers:
                print(i, j)
            else:
                print('error')
"""
"""Задача 14: Требуется вывести все целые степени двойки (т.е. числа вида 2k), не превосходящие числа N."""

"""n = int(input('Введите число N: '))
i = 1
while i < n:
    print(i, end=' ')
    i *= 2"""

"""Задача 16: Требуется вычислить, сколько раз встречается некоторое число X в массиве A[1..N]. 
Пользователь в первой строке вводит натуральное число N – количество элементов в массиве.
В последующих  строках записаны N целых чисел Ai. Последняя строка содержит число X"""

"""list_1 = []
n = int(input('На сколько элементов сделаем массив? '))
for i in range(n):
    a = int(input('Введите значение элемента  '))
    list_1.append(a)
print(list_1)
x = int(input('Какое число ищем в массиве '))
print(str(f'Число {x} встречается в массиве'),len([elem for elem in list_1 if elem == x]), str('раз.'))"""

"""Задача 18: Требуется найти в массиве A[1..N] самый близкий по величине элемент к заданному числу X. 
Пользователь в первой строке вводит натуральное число N – количество элементов в массиве. 
В последующих  строках записаны N целых чисел Ai. Последняя строка содержит число X"""

"""list_1 = []
n = int(input('На сколько элементов сделаем массив? '))
for i in range(n):
    a = int(input('Введите значение элемента  '))
    list_1.append(a)
print(list_1)
x = int(input('Какое число ищем в массиве '))
list_2 =[]
for j in range(n):
    list_2.append(abs(x - list_1[j]))
y = (list_2.index(min(list_2)))
print(str(f'Ближайшее число к {x} это {list_1[y]}'))"""

"""Задача 20: * В настольной игре Скрабл (Scrabble) каждая буква имеет определенную ценность. 
В случае с английским алфавитом очки распределяются так:A, E, I, O, U, L, N, S, T, R – 1 очко; 
D, G – 2 очка; B, C, M, P – 3 очка; F, H, V, W, Y – 4 очка; K – 5 очков; J, X – 8 очков; Q, Z – 10 очков. 
А русские буквы оцениваются так: А, В, Е, И, Н, О, Р, С, Т – 1 очко; Д, К, Л, М, П, У – 2 очка; 
Б, Г, Ё, Ь, Я – 3 очка; Й, Ы – 4 очка; Ж, З, Х, Ц, Ч – 5 очков; Ш, Э, Ю – 8 очков; Ф, Щ, Ъ – 10 очков. 
Напишите программу, которая вычисляет стоимость введенного пользователем слова. 
Будем считать, что на вход подается только одно слово, которое содержит либо только английские, 
либо только русские буквы."""

"""points = {
    1:'АВЕИНОРСТ',
    2:'ДКЛМПУ',
    3:'БГЁЬЯ',
    4:'ЙЫ',
    5:'ЖЗХЦЧ',
    8:'ШЭЮ',
    10:'ФЩЪ'}
print('Поиграем в Скрабл')
text = input('Введите слово: ').upper()
count = 0
for i in text:
  if i in 'АВЕИНОРСТДКЛМПУБГЁЬЯЙЫЖЗХЦЧШЭЮФЩЪ':
    for j in points:
      if i in points[j]:
        count +=j
print(f'За слово {text} вы получаете {count} баллов.')"""

"""Задача 22: Даны два неупорядоченных набора целых чисел (может быть, с повторениями). 
Выдать без повторений в порядке возрастания все те числа, которые встречаются в обоих наборах.
Пользователь вводит 2 числа. n - кол-во элементов первого множества. m - кол-во элементов второго множества. 
Затем пользователь вводит сами элементы множеств."""

"""list_n = []
n = int(input('На сколько элементов сделаем набор? '))
for i in range(n):
    a = int(input('Введите значение элемента  '))
    list_n.append(a)
list_m = []
m = int(input('На сколько элементов сделаем набор? '))
for i in range(n):
    a = int(input('Введите значение элемента  '))
    list_m.append(a)
set_join = set(list_n) & set(list_m)
print(list_n)
print(list_m)
print(set_join)"""

"""Задача 24: В фермерском хозяйстве в Карелии выращивают чернику. Она растет на круглой грядке, 
причем кусты высажены только по окружности. Таким образом, у каждого куста есть ровно два соседних. 
Всего на грядке растет N кустов. Эти кусты обладают разной урожайностью, поэтому ко времени сбора
на них выросло различное число ягод – на i-ом кусте выросло ai ягод.
В этом фермерском хозяйстве внедрена система автоматического сбора черники. Эта система состоит
из управляющего модуля и нескольких собирающих модулей. Собирающий модуль за один заход, 
находясь непосредственно перед некоторым кустом, собирает ягоды с этого куста и с двух соседних с ним.
Напишите программу для нахождения максимального числа ягод, которое может собрать за один заход собирающий модуль,
находясь перед некоторым кустом заданной во входном файле грядки."""

"""list_n = []
n = int(input('Сколько кустов черники? '))
for i in range(n):
    a = int(input('Сколько на кусте ягод  '))
    list_n.append(a)
maxim = 0
for i in range(len(list_n)):
    temp = list_n[i - 2] + list_n[i - 1] + list_n[i]
    if maxim < temp:
        maxim = temp
print(f'Максимальное число ягод равняется {maxim}шт.')"""

"""Задача 26:  Напишите программу, которая на вход принимает два числа A и B, 
и возводит число А в целую степень B с помощью рекурсии."""

"""a = int(input('Введите число А '))
b = int(input('Введите число B '))
def exponentiation (a, b):
    if (b == 1):
        return (a)
    if (b!=1):
        return (a * exponentiation(a, b - 1))
print(f'Число {a} в {b} степени равно:', exponentiation(a, b))"""

"""Задача 28: Напишите рекурсивную функцию sum(a, b), возвращающую сумму двух целых неотрицательных чисел. 
Из всех арифметических операций допускаются только +1 и -1. Также нельзя использовать циклы."""

"""a = int(input('Введите число А '))
b = int(input('Введите число B '))
def sum(a, b):
    return a if b == 0 else sum(a+1, b-1) if b > 0 else sum(a-1, b+1)
print(f'Сумма чисел {a} и {b} равна:', sum(a, b))"""

"""Задача 30:  Заполните массив элементами арифметической прогрессии. 
Её первый элемент, разность и количество элементов нужно ввести с клавиатуры.
Формула для получения n-го члена прогрессии: an = a1 + (n-1) * d.
Каждое число вводится с новой строки."""

"""a = int(input('Введите первое число: '))
d = int(input('Введите шаг: '))
n = int(input('Введите количество элементов: '))
for i in range(n):
    print(a+i*d)"""

"""Задача 32: Определить индексы элементов массива (списка), 
значения которых принадлежат заданному диапазону (т.е. не меньше заданного минимума и не больше заданного максимума)"""

"""list1 = []
n = int(input('Задайте размер списка '))
for i in range(n):
    a = int(input('Вводим значения списка  '))
    list1.append(a)
print(list1)
min = int(input('Вводим минимальное значение диапазона  '))
max = int(input('Вводим максимальное значение диапазона  '))
list2 = [i for i in list1 if min <= i <= max]
def index_range(list2):
    for i in list2:
        ind = list1.index(i)
        print(ind, end=" ")
print('Элементы входящие в диапазон', list2)
print('Индексы чисел, входящих в диапазон')
index_range(list2)"""

"""Задача 34:  Винни-Пух попросил Вас посмотреть, есть ли в его стихах ритм. 
Поскольку разобраться в его кричалках не настолько просто, насколько легко он их придумывает, 
Вам стоит написать программу. Винни-Пух считает, что ритм есть, если число слогов (т.е. число гласных букв) 
в каждой фразе стихотворения одинаковое. Фраза может состоять из одного слова, если во фразе несколько слов, 
то они разделяются дефисами. Фразы отделяются друг от друга пробелами. 
Стихотворение  Винни-Пух вбивает в программу с клавиатуры. В ответе напишите “Парам пам-пам”, 
если с ритмом все в порядке и “Пам парам”, если с ритмом все не в порядке"""

text = input('Введите слова стихотворения: ')
str = text.lower().split()
a = lambda x: sum(1 for i in x if i in 'аеёиоуыэюя')
b = a(str[0])
if all([a(i) == b for i in str]):
    print('Парам пам-пам')
else:
    print('Пам парам')

"""Задача 36: Напишите функцию print_operation_table(operation, num_rows=6, num_columns=6), 
которая принимает в качестве аргумента функцию, вычисляющую элемент по номеру строки и столбца. 
Аргументы num_rows и num_columns указывают число строк и столбцов таблицы, которые должны быть распечатаны. 
Нумерация строк и столбцов идет с единицы (подумайте, почему не с нуля). Примечание:
бинарной операцией называется любая операция, у которой ровно два аргумента, как, например, у операции умножения."""

def print_operation_table(x, y):
    oper = [[i*j for j in range(1,x+1)] for i in range(1,y+1)]
    for i in oper:
        print(*i)


num_rows = int(input('Введите число строк: '))
num_columns = int(input('Введите число столбцов: '))

print_operation_table(num_rows, num_columns)


